{
  "meal": [
    {
      "mealId": "1",
      "mealName": "Beef and Mustard Pie",
      "category": "Beef",
      "area": "British",
      "instructions": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
      "mealImage": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg",
      "tags": "Meat,Pie",
      "youtubeVideo": "https://www.youtube.com/watch?v=nMyBC9staMU",
      "ingredient1": "Beef",
      "ingredient2": "Plain Flour",
      "ingredient3": "Rapeseed Oil",
      "ingredient4": "Red Wine",
      "ingredient5": "Beef Stock",
      "ingredient6": "Onion",
      "ingredient7": "Carrots",
      "ingredient8": "Thyme",
      "ingredient9": "Mustard",
      "ingredient10": "Egg Yolks",
      "ingredient11": "Puff Pastry",
      "ingredient12": "Green Beans",
      "ingredient13": "Butter",
      "ingredient14": "Salt",
      "ingredient15": "Pepper",
      "source": "https://www.bbc.co.uk/food/recipes/beef_and_mustard_pie_58002",
      "price": 22.57
    },
    {
      "mealId": "2",
      "mealName": "Beef Asado",
      "category": "Beef",
      "area": "Filipino",
      "instructions": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.",
      "mealImage": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=lNlK8DVhXXA",
      "ingredient1": "Beef",
      "ingredient2": "Beef Stock Concentrate",
      "ingredient3": "Tomato Puree",
      "ingredient4": "Water",
      "ingredient5": "Soy Sauce",
      "ingredient6": "White Wine Vinegar",
      "ingredient7": "Pepper",
      "ingredient8": "Bay Leaf",
      "ingredient9": "Lemon",
      "ingredient10": "Tomato Sauce",
      "ingredient11": "Butter",
      "ingredient12": "Olive Oil",
      "ingredient13": "Onion",
      "ingredient14": "Garlic",
      "source": "https://panlasangpinoy.com/beef-asado/",
      "price": 7.76
    },
    {
      "mealId": "3",
      "mealName": "Beef and Oyster pie",
      "category": "Beef",
      "area": "British",
      "instructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg",
      "strTags": "Pie",
      "youtubeVideo": "https://www.youtube.com/watch?v=ONX74yP6JnI",
      "ingredient1": "Beef",
      "ingredient2": "Olive Oil",
      "ingredient3": "Shallots",
      "ingredient4": "Garlic",
      "ingredient5": "Bacon",
      "ingredient6": "Thyme",
      "ingredient7": "Bay Leaf",
      "ingredient8": "Stout",
      "ingredient9": "Beef Stock",
      "ingredient10": "Corn Flour",
      "ingredient11": "Oysters",
      "ingredient12": "Plain Flour",
      "ingredient13": "Salt",
      "ingredient14": "Butter",
      "ingredient15": "Eggs",
      "source": "https://www.bbc.co.uk/food/recipes/beef_and_oyster_pie_65230",
      "price": 10.58
    },
    {
      "mealId": "4",
      "mealName": "Beef Bourguignon",
      "category": "Beef",
      "area": "French",
      "instructions": "Heat a large casserole pan and add 1 tbsp goose fat. Season the beef and fry until golden brown, about 3-5 mins, then turn over and fry the other side until the meat is browned all over, adding more fat if necessary. Do this in 2-3 batches, transferring the meat to a colander set over a bowl when browned.\r\nIn the same pan, fry the bacon, shallots or pearl onions, mushrooms, garlic and bouquet garni until lightly browned. Mix in the tomato purée and cook for a few mins, stirring into the mixture. This enriches the bourguignon and makes a great base for the stew. Then return the beef and any drained juices to the pan and stir through.\r\nPour over the wine and about 100ml water so the meat bobs up from the liquid, but isn’t completely covered. Bring to the boil and use a spoon to scrape the caramelised cooking juices from the bottom of the pan – this will give the stew more flavour.\r\nHeat oven to 150C/fan 130C/gas 2. Make a cartouche: tear off a square of foil slightly larger than the casserole, arrange it in the pan so it covers the top of the stew and trim away any excess foil. Then cook for 3 hrs. If the sauce looks watery, remove the beef and veg with a slotted spoon, and set aside. Cook the sauce over a high heat for a few mins until the sauce has thickened a little, then return the beef and vegetables to the pan.\r\nTo make the celeriac mash, peel the celeriac and cut into cubes. Heat the olive oil in a large frying pan. Tip in the celeriac and fry for 5 mins until it turns golden. Season well with salt and pepper. Stir in the rosemary, thyme, bay and cardamom pods, then pour over 200ml water, enough to nearly cover the celeriac. Turn the heat to low, partially cover the pan and leave to simmer for 25-30 mins.\r\nAfter 25-30 mins, the celeriac should be soft and most of the water will have evaporated. Drain away any remaining water, then remove the herb sprigs, bay and cardamom pods. Lightly crush with a potato masher, then finish with a glug of olive oil and season to taste. Spoon the beef bourguignon into serving bowls and place a large spoonful of the celeriac mash on top. Garnish with one of the bay leaves, if you like.",
      "mealImage": "https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=SQnr4Z-7rok",
      "ingredient1": "Goose Fat",
      "ingredient2": "Beef Shin",
      "ingredient3": "Bacon",
      "ingredient4": "Challots",
      "ingredient5": "Chestnut Mushroom",
      "ingredient6": "Garlic Clove",
      "ingredient7": "Bouquet Garni",
      "ingredient8": "Tomato Puree",
      "ingredient9": "Red Wine",
      "ingredient10": "Celeriac",
      "ingredient11": "Olive Oil",
      "ingredient12": "Thyme",
      "ingredient13": "Rosemary",
      "ingredient14": "Bay Leaf",
      "ingredient15": "Cardamom",
      "source": "https://www.bbcgoodfood.com/recipes/5032/beef-bourguignon",
      "price": 10.06
    },
    {
      "mealId": "5",
      "mealName": "Beef Caldereta",
      "category": "Beef",
      "area": "Filipino",
      "instructions": "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens\r\n1.\tAdd beef. Saute until the outer part turns light brown.\r\n2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.\r\n3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.\r\n4.\tPan-fry carrot and potato until it browns. Set aside.\r\n5.\tAdd chili pepper, liver spread and peanut butter. Stir.\r\n6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.\r\n7.\tSeason with salt and ground black pepper. Serve.\r\n",
      "mealImage": "https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=yI7hTz0ft5k",
      "ingredient1": "Beef",
      "ingredient2": "Beef Stock",
      "ingredient3": "Soy Sauce",
      "ingredient4": "Water",
      "ingredient5": "Green Pepper",
      "ingredient6": "Red Pepper",
      "ingredient7": "Potatoes",
      "ingredient8": "Carrots",
      "ingredient9": "Tomato Puree",
      "ingredient10": "Peanut Butter",
      "ingredient11": "Chilli Powder",
      "ingredient12": "Onion",
      "ingredient13": "Garlic",
      "ingredient14": "Olive Oil",
      "source": "https://www.kawalingpinoy.com/beef-caldereta/",
      "price": 17.95
    },
    {
      "mealId": "6",
      "mealName": "Beef Lo Mein",
      "category": "Beef",
      "area": "Chinese",
      "instructions": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.\r\nSTEP 2 - BOILING THE THE NOODLES\r\nIn a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.\r\nSTEP 3 - STIR FRY\r\nAdd 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.\r\nSet the cooked beef aside\r\nIn a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.\r\nAdd the noodles to wok\r\nTo make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.\r\nNext add the beef to wok and stir-fry",
      "mealImage": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=ZT9LSsNXXe0",
      "ingredient1": "Beef",
      "ingredient2": "Salt",
      "ingredient3": "Pepper",
      "ingredient4": "Sesame Seed Oil",
      "ingredient5": "Egg",
      "ingredient6": "Starch",
      "ingredient7": "Oil",
      "ingredient8": "Noodles",
      "ingredient9": "Onion",
      "ingredient10": "Minced Garlic",
      "ingredient11": "Ginger",
      "ingredient12": "Bean Sprouts",
      "ingredient13": "Mushrooms",
      "ingredient14": "Water",
      "ingredient15": "Oyster Sauce",
      "ingredient16": "Sugar",
      "ingredient17": "Soy Sauce",
      "source": "https://sueandgambo.com/pages/beef-lo-mein",
      "price": 5.83
    },
    {
      "mealId": "7",
      "mealName": "Beef Mechado",
      "category": "Beef",
      "area": "Filipino",
      "instructions": "0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r\n1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r\n2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r\n3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r\n4.\tTransfer to a serving plate. Serve with Saffron rice.\r\n5.\tShare and enjoy!\r\n",
      "mealImage": "https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg",
      "strTags": "Stew, Warming",
      "youtubeVideo": "https://www.youtube.com/watch?v=jxW3Lj8VjyE",
      "ingredient1": "Garlic",
      "ingredient2": "Onion",
      "ingredient3": "Beef",
      "ingredient4": "Tomato Puree",
      "ingredient5": "Water",
      "ingredient6": "Olive Oil",
      "ingredient7": "Lemon",
      "ingredient8": "Potatoes",
      "ingredient9": "Soy Sauce",
      "ingredient10": "Black Pepper",
      "ingredient11": "Bay Leaves",
      "ingredient12": "Salt",
      "source": "https://panlasangpinoy.com/filipino-pinoy-food-tomato-sauce-beef-mechado-recipe/",
      "price": 21.27
    },
    {
      "mealId": "8",
      "mealName": "Beef Rendang",
      "category": "Beef",
      "area": "Malaysian",
      "instructions": "Chop the spice paste ingredients and then blend it in a food processor until fine.\r\nHeat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.\r\nLower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight.",
      "mealImage": "https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=Ot-dmfBaZrA",
      "ingredient1": "Beef",
      "ingredient2": "Vegetable Oil",
      "ingredient3": "Cinnamon Stick",
      "ingredient4": "Cloves",
      "ingredient5": "Star Anise",
      "ingredient6": "Cardamom",
      "ingredient7": "Coconut Cream",
      "ingredient8": "Water",
      "ingredient9": "Tamarind Paste",
      "ingredient10": "Lime",
      "ingredient11": "Sugar",
      "ingredient12": "Challots",
      "source": "https://rasamalaysia.com/beef-rendang-recipe-rendang-daging/",
      "price": 20.09
    },
    {
      "mealId": "9",
      "mealName": "Big Mac",
      "category": "Beef",
      "area": "American",
      "instructions": "For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use.\r\n2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties.\r\n3. Carefully slice each burger bun into three acrossways, then lightly toast.\r\n4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve.\r\n5. After waiting half an hour for your food to settle, go for a jog.",
      "mealImage": "https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=C5J39YnnPsg",
      "ingredient1": "Minced Beef",
      "ingredient2": "Olive Oil",
      "ingredient3": "Sesame Seed Burger Buns",
      "ingredient4": "Onion",
      "ingredient5": "Iceberg Lettuce",
      "ingredient6": "Cheese",
      "ingredient7": "Dill Pickles",
      "ingredient8": "Mayonnaise",
      "ingredient9": "White Wine Vinegar",
      "ingredient10": "Pepper",
      "ingredient11": "Mustard",
      "ingredient12": "Onion Salt",
      "ingredient13": "Garlic Powder",
      "ingredient14": "Paprika",
      "source": "https://www.delicious.com.au/recipes/finally-recipe-worlds-top-selling-burger-big-mac/5221ee4a-279e-4a0b-8629-f442dc46822e",
      "price": 11.32
    },
    {
      "mealId": "10",
      "mealName": "Ayam Percik",
      "category": "Chicken",
      "area": "Malaysian",
      "instructions": "In a blender, add the ingredients for the spice paste and blend until smooth.\r\nOver medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\r\nAdd the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\r\nWhen the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\r\nPreheat the oven to 425 F.\r\nRemove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\r\nLet chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice).",
      "mealImage": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=9ytR28QK6I8",
      "ingredient1": "Chicken Thighs",
      "ingredient2": "Challots",
      "ingredient3": "Ginger",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Cayenne Pepper",
      "ingredient6": "Turmeric",
      "ingredient7": "Cumin",
      "ingredient8": "Coriander",
      "ingredient9": "Fennel",
      "ingredient10": "Tamarind Paste",
      "ingredient11": "Coconut Milk",
      "ingredient12": "Sugar",
      "ingredient13": "Water",
      "source": "http://www.curiousnut.com/roasted-spiced-chicken-ayam-percik/",
      "price": 17.56
    },
    {
      "mealId": "11",
      "mealName": "Brown Stew Chicken",
      "category": "Chicken",
      "area": "Jamaican",
      "instructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
      "mealImage": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
      "strTags": "Stew",
      "youtubeVideo": "https://www.youtube.com/watch?v=_gFB1fkNhXs",
      "ingredient1": "Chicken",
      "ingredient2": "Tomato",
      "ingredient3": "Onions",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Red Pepper",
      "ingredient6": "Carrots",
      "ingredient7": "Lime",
      "ingredient8": "Thyme",
      "ingredient9": "Allspice",
      "ingredient10": "Soy Sauce",
      "ingredient11": "Cornstarch",
      "ingredient12": "Coconut Milk",
      "ingredient13": "Vegetable Oil",
      "source": "http://www.geniuskitchen.com/recipe/authentic-jamaican-brown-stew-chicken-347996",
      "price": 5.17
    },
    {
      "mealId": "11",
      "mealName": "Brown Stew Chicken",
      "category": "Chicken",
      "area": "Jamaican",
      "instructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
      "mealImage": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
      "strTags": "Stew",
      "youtubeVideo": "https://www.youtube.com/watch?v=_gFB1fkNhXs",
      "ingredient1": "Chicken",
      "ingredient2": "Tomato",
      "ingredient3": "Onions",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Red Pepper",
      "ingredient6": "Carrots",
      "ingredient7": "Lime",
      "ingredient8": "Thyme",
      "ingredient9": "Allspice",
      "ingredient10": "Soy Sauce",
      "ingredient11": "Cornstarch",
      "ingredient12": "Coconut Milk",
      "ingredient13": "Vegetable Oil",
      "source": "http://www.geniuskitchen.com/recipe/authentic-jamaican-brown-stew-chicken-347996",
      "price": 21.34
    },
    {
      "mealId": "12",
      "mealName": "Chicken Congee",
      "category": "Chicken",
      "area": "Chinese",
      "instructions": "STEP 1 - MARINATING THE CHICKEN\r\nIn a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r\nSet the chicken aside.\r\nSTEP 2 - RINSE THE WHITE RICE\r\nRinse the rice in a metal bowl or pot a couple times and then drain the water.\r\nSTEP 2 - BOILING THE WHITE RICE\r\nNext add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r\nAfter 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r\nNext add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r\nAfter an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r\nServe the rice porridge in a bowl\r\nOptional: add Coriander on top of the rice porridge.",
      "mealImage": "https://www.themealdb.com/images/media/meals/1529446352.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=kqEfk801E94",
      "ingredient1": "Chicken",
      "ingredient2": "Salt",
      "ingredient3": "Pepper",
      "ingredient4": "Ginger Cordial",
      "ingredient5": "Ginger",
      "ingredient6": "Spring Onions",
      "ingredient7": "Rice",
      "ingredient8": "Water",
      "ingredient9": "Coriander",
      "source": "https://sueandgambo.com/pages/chicken-congee",
      "price": 17.89
    },
    {
      "mealId": "13",
      "mealName": "Chicken Couscous",
      "category": "Chicken",
      "area": "Moroccan",
      "instructions": "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\n\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.",
      "mealImage": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=GZQGy9oscVk",
      "ingredient1": "Olive Oil",
      "ingredient2": "Onion",
      "ingredient3": "Chicken Breast",
      "ingredient4": "Ginger",
      "ingredient5": "Harissa Spice",
      "ingredient6": "Dried Apricots",
      "ingredient7": "Chickpeas",
      "ingredient8": "Couscous",
      "ingredient9": "Chicken Stock",
      "ingredient10": "Coriander",
      "source": "https://www.bbcgoodfood.com/recipes/13139/onepan-chicken-couscous",
      "price": 16.92
    },
    {
      "mealId": "14",
      "mealName": "Chicken Handi",
      "category": "Chicken",
      "area": "Indian",
      "instructions": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
      "mealImage": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=IO0issT0Rmc",
      "ingredient1": "Chicken",
      "ingredient2": "Onion",
      "ingredient3": "Tomatoes",
      "ingredient4": "Garlic",
      "ingredient5": "Ginger paste",
      "ingredient6": "Vegetable oil",
      "ingredient7": "Cumin seeds",
      "ingredient8": "Coriander seeds",
      "ingredient9": "Turmeric powder",
      "ingredient10": "Chilli powder",
      "ingredient11": "Green chilli",
      "ingredient12": "Yogurt",
      "ingredient13": "Cream",
      "ingredient14": "fenugreek",
      "ingredient15": "Garam masala",
      "ingredient16": "Salt",
      "source": "",
      "price": 22.79
    },
    {
      "mealId": "15",
      "mealName": "Chicken Karaage",
      "category": "Chicken",
      "area": "Japanese",
      "instructions": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
      "mealImage": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=XivddFddthc",
      "ingredient1": "Chicken thigh",
      "ingredient2": "Ginger",
      "ingredient3": "Garlic",
      "ingredient4": "Soy sauce",
      "ingredient5": "Sake",
      "ingredient6": "Granulated sugar",
      "ingredient7": "Potato starch",
      "ingredient8": "Vegetable oil",
      "ingredient9": "Lemon",
      "source": "https://norecipes.com/karaage-recipe",
      "price": 19.35
    },
    {
      "mealId": "16",
      "mealName": "Chicken Marengo",
      "category": "Chicken",
      "area": "French",
      "instructions": "Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r\nPour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like.",
      "mealImage": "https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=U33HYUr-0Fw",
      "ingredient1": "Olive Oil",
      "ingredient2": "Mushrooms",
      "ingredient3": "Chicken Legs",
      "ingredient4": "Passata",
      "ingredient5": "Chicken Stock Cube",
      "ingredient6": "Black Olives",
      "ingredient7": "Parsley",
      "source": "https://www.bbcgoodfood.com/recipes/3146682/chicken-marengo",
      "price": 19.17
    },
    {
      "mealId": "17",
      "mealName": "Chicken Parmentier",
      "category": "Chicken",
      "area": "French",
      "instructions": "For the topping, boil the potatoes in salted water until tender. Drain and push through a potato ricer, or mash thoroughly. Stir in the butter, cream and egg yolks. Season and set aside.\r\nFor the filling, melt the butter in a large pan. Add the shallots, carrots and celery and gently fry until soft, then add the garlic. Pour in the wine and cook for 1 minute. Stir in the tomato purée, chopped tomatoes and stock and cook for 10–15 minutes, until thickened. Add the shredded chicken, olives and parsley. Season to taste with salt and pepper.\r\nPreheat the oven to 180C/160C Fan/Gas 4.\r\nPut the filling in a 20x30cm/8x12in ovenproof dish and top with the mashed potato. Grate over the Gruyère. Bake for 30–35 minutes, until piping hot and the potato is golden-brown.",
      "mealImage": "https://www.themealdb.com/images/media/meals/uwvxpv1511557015.jpg",
      "strTags": "Meat,Dairy",
      "youtubeVideo": "https://www.youtube.com/watch?v=tiG-xlmeyjg",
      "ingredient1": "Potatoes",
      "ingredient2": "Butter",
      "ingredient3": "Double Cream",
      "ingredient4": "Egg Yolks",
      "ingredient5": "Butter",
      "ingredient6": "Shallots",
      "ingredient7": "Carrots",
      "ingredient8": "Celery",
      "ingredient9": "Garlic Clove",
      "ingredient10": "White Wine",
      "ingredient11": "Tomato Puree",
      "ingredient12": "Tinned Tomatos",
      "ingredient13": "Chicken Stock",
      "ingredient14": "Chicken",
      "ingredient15": "Black Olives",
      "ingredient16": "Parsley",
      "ingredient17": "Gruyere cheese",
      "source": "https://www.bbc.co.uk/food/recipes/chicken_parmentier_25434",
      "price": 12.42
    },
    {
      "mealId": "18",
      "mealName": "Pad See Ew",
      "category": "Chicken",
      "area": "Thai",
      "instructions": "Mix Sauce in small bowl.\r\nMince garlic into wok with oil. Place over high heat, when hot, add chicken and Chinese broccoli stems, cook until chicken is light golden.\r\nPush to the side of the wok, crack egg in and scramble. Don't worry if it sticks to the bottom of the wok - it will char and which adds authentic flavour.\r\nAdd noodles, Chinese broccoli leaves and sauce. Gently mix together until the noodles are stained dark and leaves are wilted. Serve immediately!",
      "mealImage": "https://www.themealdb.com/images/media/meals/uuuspp1468263334.jpg",
      "strTags": "Pasta",
      "youtubeVideo": "https://www.youtube.com/watch?v=Ohy1DELF4is",
      "ingredient1": "rice stick noodles",
      "ingredient2": "dark soy sauce",
      "ingredient3": "oyster sauce",
      "ingredient4": "soy sauce",
      "ingredient5": "white vinegar",
      "ingredient6": "sugar",
      "ingredient7": "water",
      "ingredient8": "peanut oil",
      "ingredient9": "garlic",
      "ingredient10": "Chicken",
      "ingredient11": "Egg",
      "ingredient12": "Chinese broccoli",
      "price": 6.02
    },
    {
      "mealId": "19",
      "mealName": "Apam balik",
      "category": "Dessert",
      "area": "Malaysian",
      "instructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
      "mealImage": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=6R8ffRRJcrg",
      "ingredient1": "Milk",
      "ingredient2": "Oil",
      "ingredient3": "Eggs",
      "ingredient4": "Flour",
      "ingredient5": "Baking Powder",
      "ingredient6": "Salt",
      "ingredient7": "Unsalted Butter",
      "ingredient8": "Sugar",
      "ingredient9": "Peanut Butter",
      "source": "https://www.nyonyacooking.com/recipes/apam-balik~SJ5WuvsDf9WQ",
      "price": 13.44
    },
    {
      "mealId": "20",
      "mealName": "Bakewell tart",
      "category": "Dessert",
      "area": "British",
      "instructions": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg",
      "strTags": "Tart,Baking,Alcoholic",
      "youtubeVideo": "https://www.youtube.com/watch?v=1ahpSTf_Pvk",
      "ingredient1": "plain flour",
      "ingredient2": "chilled butter",
      "ingredient3": "cold water",
      "ingredient4": "raspberry jam",
      "ingredient5": "butter",
      "ingredient6": "caster sugar",
      "ingredient7": "ground almonds",
      "ingredient8": "free-range egg, beaten",
      "ingredient9": "almond extract",
      "ingredient10": "flaked almonds",
      "price": 23.96
    },
    {
      "mealId": "21",
      "mealName": "Banana Pancakes",
      "category": "Dessert",
      "area": "American",
      "instructions": "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.",
      "mealImage": "https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg",
      "strTags": "Breakfast,Desert,Sweet",
      "youtubeVideo": "https://www.youtube.com/watch?v=kSKtb2Sv-_U",
      "ingredient1": "Banana",
      "ingredient2": "Eggs",
      "ingredient3": "Baking Powder",
      "ingredient4": "Vanilla Extract",
      "ingredient5": "Oil",
      "ingredient6": "Pecan Nuts",
      "ingredient7": "Raspberries",
      "source": "https://www.bbcgoodfood.com/recipes/banana-pancakes",
      "price": 23.43
    },
    {
      "mealId": "22",
      "mealName": "Kapsalon",
      "category": "Lamb",
      "area": "Dutch",
      "instructions": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
      "mealImage": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg",
      "strTags": "Snack",
      "youtubeVideo": "https://www.youtube.com/watch?v=UIcuiU1kV8I",
      "ingredient1": "Fries",
      "ingredient2": "Doner Meat",
      "ingredient3": "Garlic sauce",
      "ingredient4": "Hotsauce",
      "ingredient5": "Lettuce",
      "ingredient6": "Tomato",
      "ingredient7": "Cucumber",
      "ingredient8": "Gouda cheese",
      "price": 9.19
    },
    {
      "mealId": "23",
      "mealName": "Lamb Biryani",
      "category": "Lamb",
      "area": "Indian",
      "instructions": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.\r\n\r\nNow, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!\r\nNotes\r\n1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also.",
      "mealImage": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
      "strTags": "Curry,Meat",
      "youtubeVideo": "https://www.youtube.com/watch?v=r7SYVSG5nxo",
      "ingredient1": "Cashew nuts",
      "ingredient2": "Khus khus",
      "ingredient3": "Cumin seeds",
      "ingredient4": "Onions",
      "ingredient5": "Ginger garlic paste",
      "ingredient6": "Garlic",
      "ingredient7": "Mint",
      "ingredient8": "Cilantro",
      "ingredient9": "Saffron",
      "ingredient10": "Ghee",
      "ingredient11": "Basmati rice",
      "ingredient12": "Full fat yogurt",
      "ingredient13": "Cumin Seeds",
      "ingredient14": "Bay leaf",
      "ingredient15": "Cinnamon",
      "ingredient16": "Cloves",
      "ingredient17": "Cardamom",
      "ingredient18": "Lamb",
      "ingredient19": "Red Chilli powder",
      "ingredient20": "Biryani masala",
      "price": 17.56
    },
    {
      "mealId": "24",
      "mealName": "Lamb Pilaf (Plov)",
      "category": "Lamb",
      "area": "Russian",
      "instructions": "Place the raisins and prunes into a small bowl and pour over enough water to cover. Add lemon juice and let soak for at least 1 hour. Drain. Roughly chop the prunes.\r\n\r\nMeanwhile, heat the butter in a large pan, add the onion, and cook for 5 minutes. Add cubed lamb, ground lamb, and crushed garlic cloves. Fry for 5 minutes, stirring constantly until browned.\r\n\r\nPour 2/3 cup (150 milliliters) of stock into the pan. Bring to a boil, then lower the heat, cover, and simmer for 1 hour, or until the lamb is tender.\r\n\r\nAdd the remaining stock and bring to a boil. Add rinsed long-grain white rice and a large pinch of saffron. Stir, then cover, and simmer for 15 minutes, or until the rice is tender.\r\n\r\nAdd the drained raisins, drained chopped prunes, and salt and pepper to taste. Heat through for a few minutes, then turn out onto a warmed serving dish and garnish with sprigs of flat-leaf parsley.",
      "mealImage": "https://www.themealdb.com/images/media/meals/kos9av1699014767.jpg",
      "strTags": "rice",
      "youtubeVideo": "https://www.youtube.com/watch?v=rllQsUw1hFQ",
      "ingredient1": "Lamb",
      "ingredient2": "Prunes",
      "ingredient3": "Lemon Juice",
      "ingredient4": "Butter",
      "ingredient5": "Onion",
      "ingredient6": "Lamb",
      "ingredient7": "Garlic",
      "ingredient8": "Vegetable Stock",
      "ingredient9": "Rice",
      "ingredient10": "Saffron",
      "ingredient11": "Parsley",
      "source": "https://www.thespruceeats.com/russian-lamb-pilaf-plov-recipe-1137309",
      "price": 10.06
    },
    {
      "mealId": "25",
      "mealName": "Lamb Tagine",
      "category": "Lamb",
      "area": "Moroccan",
      "instructions": "Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.\r\n\r\nAdd the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.\r\n\r\nAdd the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.\r\n\r\nRemove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using.",
      "mealImage": "https://www.themealdb.com/images/media/meals/yuwtuu1511295751.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=bR5Cqu84S_k",
      "ingredient1": "Olive Oil",
      "ingredient2": "Onion",
      "ingredient3": "Carrots",
      "ingredient4": "Lamb Leg",
      "ingredient5": "Garlic",
      "ingredient6": "Cumin",
      "ingredient7": "Ginger",
      "ingredient8": "Saffron",
      "ingredient9": "Cinnamon",
      "ingredient10": "Honey",
      "ingredient11": "Apricot",
      "ingredient12": "Vegetable Stock Cube",
      "ingredient13": "Butternut Squash",
      "ingredient14": "Couscous",
      "ingredient15": "Parsley",
      "source": "https://www.bbcgoodfood.com/recipes/2303638/family-meals-easy-lamb-tagine-",
      "price": 10.45
    },
    {
      "mealId": "26",
      "mealName": "Chakchouka ",
      "category": "Miscellaneous",
      "area": "Tunisian",
      "instructions": "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita.",
      "mealImage": "https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=EHKNu93MSx4",
      "ingredient1": "Tomatoes",
      "ingredient2": "Olive Oil",
      "ingredient3": "Onion",
      "ingredient4": "Red Pepper",
      "ingredient5": "Green Pepper",
      "ingredient6": "Garlic",
      "ingredient7": "Cumin",
      "ingredient8": "Paprika",
      "ingredient9": "Salt",
      "ingredient10": "Chili Powder",
      "ingredient11": "Eggs",
      "source": "https://www.curiouscuisiniere.com/chakchouka/",
      "price": 15.6
    },
    {
      "mealId": "27",
      "mealName": "Duck Confit",
      "category": "Miscellaneous",
      "area": "French",
      "instructions": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=MHhLJqghY-o",
      "ingredient1": "Sea Salt",
      "ingredient2": "Bay Leaf",
      "ingredient3": "Garlic",
      "ingredient4": "Thyme",
      "ingredient5": "Duck Legs",
      "ingredient6": "White Wine",
      "source": "https://www.bbcgoodfood.com/recipes/2085/barneys-confit-of-duck",
      "price": 16.62
    },
    {
      "mealId": "28",
      "mealName": "French Omelette",
      "category": "Miscellaneous",
      "area": "French",
      "instructions": "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. Crack the eggs into a bowl and beat them with a fork so they break up and mix, but not as completely as you would for scrambled egg. With the heat on medium-hot, drop one knob of butter into the pan. It should bubble and sizzle, but not brown. Season the eggs with the Parmesan and a little salt and pepper, and pour into the pan.\r\nLet the eggs bubble slightly for a couple of seconds, then take a wooden fork or spatula and gently draw the mixture in from the sides of the pan a few times, so it gathers in folds in the centre. Leave for a few seconds, then stir again to lightly combine uncooked egg with cooked. Leave briefly again, and when partly cooked, stir a bit faster, stopping while there’s some barely cooked egg left. With the pan flat on the heat, shake it back and forth a few times to settle the mixture. It should slide easily in the pan and look soft and moist on top. A quick burst of heat will brown the underside.\r\nGrip the handle underneath. Tilt the pan down away from you and let the omelette fall to the edge. Fold the side nearest to you over by a third with your fork, and keep it rolling over, so the omelette tips onto a plate – or fold it in half, if that’s easier. For a neat finish, cover the omelette with a piece of kitchen paper and plump it up a bit with your fingers. Rub the other knob of butter over to glaze. Serve immediately.",
      "mealImage": "https://www.themealdb.com/images/media/meals/yvpuuy1511797244.jpg",
      "strTags": "Egg",
      "youtubeVideo": "https://www.youtube.com/watch?v=qXPhVYpQLPA",
      "ingredient1": "Eggs",
      "ingredient2": "Butter",
      "ingredient3": "Parmesan",
      "ingredient4": "Tarragon",
      "ingredient5": "Parsley",
      "ingredient6": "Chives",
      "ingredient7": "Gruyère",
      "source": "https://www.bbcgoodfood.com/recipes/1669/ultimate-french-omelette",
      "price": 23.83
    },
    {
      "mealId": "29",
      "mealName": "Turkey Meatloaf",
      "category": "Miscellaneous",
      "area": "British",
      "instructions": "Heat oven to 180C/160C fan/gas 4. Heat the oil in a large frying pan and cook the onion for 8-10 mins until softened. Add the garlic, Worcestershire sauce and 2 tsp tomato purée, and stir until combined. Set aside to cool.\r\n\r\nPut the turkey mince, egg, breadcrumbs and cooled onion mix in a large bowl and season well. Mix everything to combine, then shape into a rectangular loaf and place in a large roasting tin. Spread 2 tbsp barbecue sauce over the meatloaf and bake for 30 mins.\r\n\r\nMeanwhile, drain 1 can of beans only, then pour both cans into a large bowl. Add the remaining barbecue sauce and tomato purée. Season and set aside.\r\n\r\nWhen the meatloaf has had its initial cooking time, scatter the beans around the outside and bake for 15 mins more until the meatloaf is cooked through and the beans are piping hot. Scatter over the parsley and serve the meatloaf in slices.",
      "mealImage": "https://www.themealdb.com/images/media/meals/ypuxtw1511297463.jpg",
      "strTags": "Alcoholic",
      "youtubeVideo": "https://www.youtube.com/watch?v=mTvlmY4vCug",
      "ingredient1": "Olive Oil",
      "ingredient2": "Onion",
      "ingredient3": "Garlic",
      "ingredient4": "Worcestershire Sauce",
      "ingredient5": "Tomato Puree",
      "ingredient6": "Turkey Mince",
      "ingredient7": "Eggs",
      "ingredient8": "Breadcrumbs",
      "ingredient9": "Barbeque Sauce",
      "ingredient10": "Cannellini Beans",
      "ingredient11": "Parsley",
      "source": "https://www.bbcgoodfood.com/recipes/turkey-meatloaf",
      "price": 14.05
    },
    {
      "mealId": "30",
      "mealName": "Poutine",
      "category": "Miscellaneous",
      "area": "Canadian",
      "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C).\r\nWarm gravy in saucepan or microwave.\r\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes.\r\nRemove to a paper towel lined plate to drain.\r\nPlace the fries on a serving platter, and sprinkle the cheese over them.\r\nLadle gravy over the fries and cheese, and serve immediately.",
      "mealImage": "https://www.themealdb.com/images/media/meals/uuyrrx1487327597.jpg",
      "strTags": "UnHealthy,Speciality,HangoverFood",
      "youtubeVideo": "https://www.youtube.com/watch?v=UVAMAoA2_WU",
      "ingredient1": "Vegetable Oil",
      "ingredient2": "Beef Gravy",
      "ingredient3": "Potatoes",
      "ingredient4": "Cheese Curds",
      "source": "http://www.food.com/recipe/real-canadian-poutine-113388",
      "price": 12.57
    },
    {
      "mealId": "31",
      "mealName": "Chilli prawn linguine",
      "category": "Pasta",
      "area": "Italian",
      "instructions": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
      "mealImage": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=SC17Mc70Db0",
      "ingredient1": "Linguine Pasta",
      "ingredient2": "Sugar Snap Peas",
      "ingredient3": "Olive Oil",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Red Chilli",
      "ingredient6": "King Prawns",
      "ingredient7": "Cherry Tomatoes",
      "ingredient8": "Basil Leaves",
      "ingredient9": "Lettuce",
      "ingredient10": "Bread",
      "ingredient11": "Fromage Frais",
      "ingredient12": "Lime",
      "ingredient13": "Caster Sugar",
      "source": "https://www.bbcgoodfood.com/recipes/1269/chilli-prawn-linguine",
      "price": 20.8
    },
    {
      "mealId": "31",
      "mealName": "Fettuccine Alfredo",
      "category": "Pasta",
      "area": "Italian",
      "instructions": "Cook pasta according to package instructions in a large pot of boiling water and salt. Add heavy cream and butter to a large skillet over medium heat until the cream bubbles and the butter melts. Whisk in parmesan and add seasoning (salt and black pepper). Let the sauce thicken slightly and then add the pasta and toss until coated in sauce. Garnish with parsley, and it's ready.",
      "mealImage": "https://www.themealdb.com/images/media/meals/0jv5gx1661040802.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=LPPcNPdq_j4",
      "ingredient1": "Fettuccine",
      "ingredient2": "Heavy Cream",
      "ingredient3": "Butter",
      "ingredient4": "Parmesan",
      "ingredient5": "Parsley",
      "ingredient6": "Black Pepper",
      "source": "https://www.delish.com/cooking/recipe-ideas/a55312/best-homemade-fettuccine-alfredo-recipe/",
      "price": 11.11
    },
    {
      "mealId": "32",
      "mealName": "Lasagna Sandwiches",
      "category": "Pasta",
      "area": "American",
      "instructions": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein.",
      "mealImage": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg",
      "strTags": "Sandwich",
      "ingredient1": "Sour Cream",
      "ingredient2": "Chopped Onion",
      "ingredient3": "Dried Oregano",
      "ingredient4": "Salt",
      "ingredient5": "Bread",
      "ingredient6": "Bacon",
      "ingredient7": "Tomato",
      "ingredient8": "Mozzarella",
      "ingredient9": "Butter",
      "source": "",
      "price": 19.42
    },
    {
      "mealId": "34",
      "mealName": "Lasagne",
      "category": "Pasta",
      "area": "Italian",
      "instructions": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\r\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\r\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\r\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\r\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=gfhfsBPt46s",
      "ingredient1": "Olive Oil",
      "ingredient2": "Bacon",
      "ingredient3": "Onion",
      "ingredient4": "Celery",
      "ingredient5": "Carrots",
      "ingredient6": "Garlic",
      "ingredient7": "Minced Beef",
      "ingredient8": "Tomato Puree",
      "ingredient9": "Chopped Tomatoes",
      "ingredient10": "Honey",
      "ingredient11": "Lasagne Sheets",
      "ingredient12": "Creme Fraiche",
      "ingredient13": "Mozzarella Balls",
      "ingredient14": "Parmesan Cheese",
      "ingredient15": "Basil Leaves",
      "source": "https://www.bbcgoodfood.com/recipes/classic-lasagne",
      "price": 8.31
    },
    {
      "mealId": "35",
      "mealName": " Bubble & Squeak",
      "category": "Pork",
      "area": "British",
      "instructions": "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.\r\nNext, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.",
      "mealImage": "https://www.themealdb.com/images/media/meals/xusqvw1511638311.jpg",
      "strTags": "SideDish,Speciality",
      "youtubeVideo": "https://www.youtube.com/watch?v=etbJ9ssgsWY",
      "ingredient1": "Butter",
      "ingredient2": "Bacon",
      "ingredient3": "Onion",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Brussels Sprouts",
      "ingredient6": "Potatoes",
      "source": "https://www.bbcgoodfood.com/recipes/164622/bubble-and-squeak",
      "price": 24.07
    },
    {
      "mealId": "36",
      "mealName": "Boxty Breakfast",
      "category": "Pork",
      "area": "Irish",
      "instructions": "STEP 1\r\nBefore you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.\r\n\r\nSTEP 2\r\nWhisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.\r\n\r\nSTEP 3\r\nHeat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.\r\n\r\nSTEP 4\r\nHeat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side.",
      "mealImage": "https://www.themealdb.com/images/media/meals/naqyel1608588563.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=80W0mCFDIP0",
      "ingredient1": "Potatoes",
      "ingredient2": "Spring Onions",
      "ingredient3": "Plain Flour",
      "ingredient4": "Egg White",
      "ingredient5": "Milk",
      "ingredient6": "Bicarbonate Of Soda",
      "ingredient7": "Butter",
      "ingredient8": "Vegetable Oil",
      "ingredient9": "Cherry Tomatoes",
      "ingredient10": "Bacon",
      "ingredient11": "Egg",
      "source": "https://www.bbcgoodfood.com/recipes/boxty-bacon-eggs-tomatoes",
      "price": 23.99
    },
    {
      "mealId": "37",
      "mealName": "Ham hock colcannon",
      "category": "Pork",
      "area": "Irish",
      "instructions": "STEP 1\r\nPeel and cut the potatoes into even, medium-sized chunks. Put in a large pan filled with cold salted water, bring to the boil and cook for 10-15 mins until a knife can be inserted into the potatoes easily.\r\n\r\nSTEP 2\r\nMeanwhile, melt the butter in a large sauté pan over a medium heat. Add the garlic, cabbage, spring onions and some seasoning. Stir occasionally until the cabbage is wilted but still retains a little bite, then set aside.\r\n\r\nSTEP 3\r\nDrain the potatoes, leave to steam-dry for a couple of mins, then mash with the cream, mustard and seasoning in the same saucepan. Stir in the cabbage and ham hock. Keep warm over a low heat.\r\n\r\nSTEP 4\r\nReheat the pan you used to cook the cabbage (no need to wash first), add a splash of oil, crack in the eggs and fry to your liking. To serve, divide the colcannon between bowls and top each with a fried egg.",
      "mealImage": "https://www.themealdb.com/images/media/meals/n41ny81608588066.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=aQJAU2iJ730",
      "ingredient1": "Floury Potatoes",
      "ingredient2": "Butter",
      "ingredient3": "Garlic Clove",
      "ingredient4": "Cabbage",
      "ingredient5": "Spring Onions",
      "ingredient6": "Double Cream",
      "ingredient7": "Mustard",
      "ingredient8": "Ham",
      "ingredient9": "Eggs",
      "source": "https://www.bbcgoodfood.com/recipes/ham-hock-colcannon",
      "price": 6.12
    },
    {
      "mealId": "38",
      "mealName": "Pork Cassoulet",
      "category": "Pork",
      "area": "French",
      "instructions": "Heat oven to 140C/120C fan/gas 1. Put a large ovenproof pan (with a tight-fitting lid) on a high heat. Add your fat and diced meat, cook for a few mins to seal the edges, giving it a quick stir to cook evenly. Reduce the heat to low, add the sliced onion, whole garlic cloves, carrot and fennel seeds, and cook gently to soften the veg for a few mins.\r\nPour over the red wine vinegar, scraping any meaty bits off the bottom of the pan. Add the stock, tomato purée, and half the rosemary and parsley. Bring to the boil and simmer for 10 mins, then season, cover with a lid and put into the oven for 2 hrs, removing the lid for the final hour of cooking. Stir occasionally and add the beans with 30 mins to go.\r\nRemove the pan from the oven and heat the grill. Scatter the top with the remaining herbs and breadcrumbs, drizzle a little oil over the top, and return to the oven for 5-10 mins, until the breadcrumbs are golden. Serve with crusty bread and green veg.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wxuvuv1511299147.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=MEdHMTD0VCA",
      "ingredient1": "Goose Fat",
      "ingredient2": "Pork",
      "ingredient3": "Onion",
      "ingredient4": "Garlic",
      "ingredient5": "Carrots",
      "ingredient6": "Fennel Seeds",
      "ingredient7": "Red Wine Vinegar",
      "ingredient8": "Vegetable Stock",
      "ingredient9": "Tomato Puree",
      "ingredient10": "Rosemary",
      "ingredient11": "Parsley",
      "ingredient12": "Haricot Beans",
      "ingredient13": "Breadcrumbs",
      "ingredient14": "Oil",
      "ingredient15": "Bread",
      "ingredient16": "Broccoli",
      "source": "https://www.bbcgoodfood.com/recipes/jacks-pork-cassoulet",
      "price": 13.6
    },
    {
      "mealId": "39",
      "mealName": "Sweet and Sour Pork",
      "category": "Pork",
      "area": "Chinese",
      "instructions": "Preparation\r\n1. Crack the egg into a bowl. Separate the egg white and yolk.\r\n\r\nSweet and Sour Pork\r\n2. Slice the pork tenderloin into strips.\r\n\r\n3. Prepare the marinade using a pinch of salt, one teaspoon of starch, two teaspoons of light soy sauce, and an egg white.\r\n\r\n4. Marinade the pork strips for about 20 minutes.\r\n\r\n5. Put the remaining starch in a bowl. Add some water and vinegar to make a starchy sauce.\r\n\r\nSweet and Sour Pork\r\nCooking Instructions\r\n1. Pour the cooking oil into a wok and heat to 190°C (375°F). Add the marinated pork strips and fry them until they turn brown. Remove the cooked pork from the wok and place on a plate.\r\n\r\n2. Leave some oil in the wok. Put the tomato sauce and white sugar into the wok, and heat until the oil and sauce are fully combined.\r\n\r\n3. Add some water to the wok and thoroughly heat the sweet and sour sauce before adding the pork strips to it.\r\n\r\n4. Pour in the starchy sauce. Stir-fry all the ingredients until the pork and sauce are thoroughly mixed together.\r\n\r\n5. Serve on a plate and add some coriander for decoration.",
      "mealImage": "https://www.themealdb.com/images/media/meals/1529442316.jpg",
      "strTags": "Sweet",
      "youtubeVideo": "https://www.youtube.com/watch?v=mdaBIhgEAMo",
      "ingredient1": "Pork",
      "ingredient2": "Egg",
      "ingredient3": "Water",
      "ingredient4": "Salt",
      "ingredient5": "Sugar",
      "ingredient6": "Soy Sauce",
      "ingredient7": "Starch",
      "ingredient8": "Tomato Puree",
      "ingredient9": "Vinegar",
      "ingredient10": "Coriander",
      "source": "https://www.chinahighlights.com/travelguide/chinese-food/cooking/sweet-sour-pork.htm",
      "price": 18.98
    },
    {
      "mealId": "40",
      "mealName": "Tonkatsu pork",
      "category": "Pork",
      "area": "Japanese",
      "instructions": "STEP 1\r\nRemove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.\r\n\r\nSTEP 2\r\nPut the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.\r\n\r\nSTEP 3\r\nIn a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.\r\n\r\nSTEP 4\r\nWhile the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce.",
      "mealImage": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=aASr5x0d3Ys",
      "ingredient1": "Pork Chops",
      "ingredient2": "Flour",
      "ingredient3": "Eggs",
      "ingredient4": "Breadcrumbs",
      "ingredient5": "Vegetable Oil",
      "ingredient6": "Tomato Ketchup",
      "ingredient7": "Worcestershire Sauce",
      "ingredient8": "Oyster Sauce",
      "ingredient9": "Caster Sugar",
      "source": "https://www.bbcgoodfood.com/recipes/tonkatsu-pork",
      "price": 15.26
    },
    {
      "mealId": "41",
      "mealName": "Escovitch Fish",
      "category": "Seafood",
      "area": "Jamaican",
      "instructions": "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.\r\n\r\nIn large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil\r\nAdd, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn\r\nThen add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. \r\n\r\nDiscard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance.",
      "mealImage": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
      "strTags": "Seafood,Spicy,Speciality,Easter",
      "youtubeVideo": "https://www.youtube.com/watch?v=nF6DOtGE6k8",
      "ingredient1": "Red Snapper",
      "ingredient2": "Vegetable Oil",
      "ingredient3": "Garlic",
      "ingredient4": "Ginger",
      "ingredient5": "Thyme",
      "ingredient6": "Bay Leaf",
      "ingredient7": "Red Pepper",
      "ingredient8": "Yellow Pepper",
      "ingredient9": "Onion",
      "ingredient10": "Carrots",
      "ingredient11": "Sugar",
      "ingredient12": "Allspice",
      "ingredient13": "Worcestershire Sauce",
      "ingredient14": "Scotch Bonnet",
      "ingredient15": "Lime",
      "ingredient16": "Malt Vinegar",
      "ingredient17": "Pepper",
      "source": "https://www.africanbites.com/jamaican-escovitched-fish/",
      "price": 14.55
    },
    {
      "mealId": "42",
      "mealName": "Fish fofos",
      "category": "Seafood",
      "area": "Portuguese",
      "instructions": "STEP 1\r\n\r\nPut the fish into a lidded pan and pour over enough water to cover. Bring to a simmer and gently poach for 10 minutes over a low heat with the lid on. Drain and flake the fish.\r\n\r\nSTEP 2\r\n\r\nPut the fish, potato, green chilli, coriander, cumin, black pepper, garlic and ginger in a large bowl. Season, add the rice flour, mix well and break in 1 egg. Stir the mixture and divide into 15, then form into small logs. Break the remaining eggs into a bowl and whisk lightly. Put the breadcrumbs into another bowl. Dip each fofo in the beaten egg followed by the breadcrumb mixture. Chill for 20 minutes.\r\n\r\nSTEP 3\r\n\r\nHeat 1cm of oil in a large frying pan over a medium heat. Fry the fofos in batches for 2 minutes on each side, turning gently to get an even golden brown colour all over. Drain on kitchen paper and repeat with the remaining fofos.\r\n\r\nSTEP 4\r\n\r\nFor the onion salad, mix together the onion, coriander and lemon juice with a pinch of salt. Serve with the fofos and mango chutney.",
      "mealImage": "https://www.themealdb.com/images/media/meals/a15wsa1614349126.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=YXUZHK2PrV8",
      "ingredient1": "Haddock",
      "ingredient2": "Potatoes",
      "ingredient3": "Green Chilli",
      "ingredient4": "Coriander",
      "ingredient5": "Cumin Seeds",
      "ingredient6": "Pepper",
      "ingredient7": "Garlic",
      "ingredient8": "Ginger",
      "ingredient9": "Flour",
      "ingredient10": "Eggs",
      "ingredient11": "Breadcrumbs",
      "ingredient12": "Vegetable Oil",
      "source": "https://www.olivemagazine.com/recipes/fish-and-seafood/fish-fofos/",
      "price": 9.75
    },
    {
      "mealId": "43",
      "mealName": "Fish pie",
      "category": "Seafood",
      "area": "British",
      "instructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\r\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\r\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\r\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\r\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens.",
      "mealImage": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
      "strTags": "Fish,Pie,Breakfast,Baking",
      "youtubeVideo": "https://www.youtube.com/watch?v=2sX4fCgg-UI",
      "ingredient1": "Floury Potatoes",
      "ingredient2": "Olive Oil",
      "ingredient3": "Semi-skimmed Milk",
      "ingredient4": "White Fish Fillets",
      "ingredient5": "Plain flour",
      "ingredient6": "Nutmeg",
      "ingredient7": "Double Cream",
      "ingredient8": "Jerusalem Artichokes",
      "ingredient9": "Leek",
      "ingredient10": "Prawns",
      "ingredient11": "Parsley",
      "ingredient12": "Dill",
      "ingredient13": "Lemon",
      "ingredient14": "Gruyère",
      "ingredient15": "Lemon",
      "price": 9.71
    },
    {
      "mealId": "44",
      "mealName": "Fish Soup (Ukha)",
      "category": "Seafood",
      "area": "Russian",
      "instructions": "In a medium pot, heat the olive oil over medium-high heat. Add the onions and cook, stirring occasionally until the onions start to caramelize. Add the carrots and cook until the carrots start to soften, about 4 more minutes.\r\nAdd the stock, water, potatoes, bay leaves, and black peppercorns. Season with salt and bring to a boil. Reduce heat, cover and cook for 10 minutes. Add the millet and cook for 15 more minutes until millet and potatoes are cooked.\r\nGently add the fish cubes. Stir and bring the soup to a simmer. The fish will cook through very fast, so make sure to not overcook them. They are done when the flesh is opaque and flakes easily.\r\nGarnish the soup with chopped fresh dill or parsley before serving.",
      "mealImage": "https://www.themealdb.com/images/media/meals/7n8su21699013057.jpg",
      "strTags": "soup",
      "youtubeVideo": "https://www.youtube.com/watch?v=cS3Yn-y5uVg",
      "ingredient1": "Olive Oil",
      "ingredient2": "Onion",
      "ingredient3": "Carrots",
      "ingredient4": "Fish Stock",
      "ingredient5": "Water",
      "ingredient6": "Potatoes",
      "ingredient7": "Bay Leaf",
      "ingredient8": "Cod",
      "ingredient9": "Salmon",
      "source": "https://www.curiouscuisiniere.com/ukha-russian-fish-soup/",
      "price": 10.88
    },
    {
      "mealId": "45",
      "mealName": "Garides Saganaki",
      "category": "Seafood",
      "area": "Greek",
      "instructions": "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside.\r\nHeat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened.\r\nWhile the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on.\r\nWhen the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread.\r\nThough completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve.",
      "mealImage": "https://www.themealdb.com/images/media/meals/wuvryu1468232995.jpg",
      "strTags": "Seafood,Shellfish",
      "youtubeVideo": "https://www.youtube.com/watch?v=uO0ejc85zSE",
      "ingredient1": "Raw king prawns",
      "ingredient2": "Olive oil",
      "ingredient3": "Chopped onion",
      "ingredient4": "Freshly chopped parsley",
      "ingredient5": "White wine",
      "ingredient6": "Chopped tomatoes",
      "ingredient7": "Minced garlic",
      "ingredient8": "Cubed Feta cheese",
      "price": 9.48
    },
    {
      "mealId": "46",
      "mealName": "Blini Pancakes",
      "category": "Side",
      "area": "Russian",
      "instructions": "In a large bowl, whisk together 1/2 cup buckwheat flour, 2/3 cup all-purpose flour, 1/2 teaspoon salt, and 1 teaspoon yeast.\r\n\r\nMake a well in the center and pour in 1 cup warm milk, whisking until the batter is smooth.\r\n\r\nCover the bowl and let the batter rise until doubled, about 1 hour.\r\n\r\nEnrich and Rest the Batter\r\nStir 2 tablespoons melted butter and 1 egg yolk into the batter.\r\n\r\nIn a separate bowl, whisk 1 egg white until stiff, but not dry.\r\n\r\nFold the whisked egg white into the batter.\r\n\r\nCover the bowl and let the batter stand 20 minutes.\r\n\r\nPan-Fry the Blini\r\nHeat butter in a large nonstick skillet over medium heat.\r\n\r\nDrop quarter-sized dollops of batter into the pan, being careful not to overcrowd the pan. Cook for about 1 minute or until bubbles form.\r\n\r\nTurn and cook for about 30 additional seconds.\r\n\r\nRemove the finished blini onto a plate and cover them with a clean kitchen towel to keep warm. Add more butter to the pan and repeat the frying process with the remaining batter.",
      "mealImage": "https://www.themealdb.com/images/media/meals/0206h11699013358.jpg",
      "strTags": "pancake",
      "youtubeVideo": "https://www.youtube.com/watch?v=GsB8ZI5vREA",
      "ingredient1": "Buckwheat",
      "ingredient2": "Flour",
      "ingredient3": "Salt",
      "ingredient4": "Yeast",
      "ingredient5": "Milk",
      "ingredient6": "Butter",
      "ingredient7": "Egg",
      "source": "https://www.thespruceeats.com/russian-blini-recipe-buckwheat-pancakes-1136797",
      "price": 18.38
    },
    {
      "mealId": "47",
      "mealName": "Burek",
      "category": "Side",
      "area": "Croatian",
      "instructions": "Fry the finely chopped onions and minced meat in oil. Add the salt and pepper. Grease a round baking tray and put a layer of pastry in it. Cover with a thin layer of filling and cover this with another layer of filo pastry which must be well coated in oil. Put another layer of filling and cover with pastry. When you have five or six layers, cover with filo pastry, bake at 200ºC/392ºF for half an hour and cut in quarters and serve.",
      "mealImage": "https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg",
      "strTags": "Streetfood, Onthego",
      "youtubeVideo": "https://www.youtube.com/watch?v=YsJXZwE5pdY",
      "ingredient1": "Filo Pastry",
      "ingredient2": "Minced Beef",
      "ingredient3": "Onion",
      "ingredient4": "Oil",
      "ingredient5": "Salt",
      "ingredient6": "Pepper",
      "source": "https://www.visit-croatia.co.uk/croatian-cuisine/croatian-recipes/",
      "price": 13.9
    },
    {
      "mealId": "48",
      "mealName": "Corba",
      "category": "Side",
      "area": "Turkish",
      "instructions": "Pick through your lentils for any foreign debris, rinse them 2 or 3 times, drain, and set aside.  Fair warning, this will probably turn your lentils into a solid block that you’ll have to break up later\r\nIn a large pot over medium-high heat, sauté the olive oil and the onion with a pinch of salt for about 3 minutes, then add the carrots and cook for another 3 minutes.\r\nAdd the tomato paste and stir it around for around 1 minute. Now add the cumin, paprika, mint, thyme, black pepper, and red pepper as quickly as you can and stir for 10 seconds to bloom the spices. Congratulate yourself on how amazing your house now smells.\r\nImmediately add the lentils, water, broth, and salt. Bring the soup to a (gentle) boil.\r\nAfter it has come to a boil, reduce heat to medium-low, cover the pot halfway, and cook for 15-20 minutes or until the lentils have fallen apart and the carrots are completely cooked.\r\nAfter the soup has cooked and the lentils are tender, blend the soup either in a blender or simply use a hand blender to reach the consistency you desire. Taste for seasoning and add more salt if necessary.\r\nServe with crushed-up crackers, torn up bread, or something else to add some extra thickness.  You could also use a traditional thickener (like cornstarch or flour), but I prefer to add crackers for some texture and saltiness.  Makes great leftovers, stays good in the fridge for about a week.",
      "mealImage": "https://www.themealdb.com/images/media/meals/58oia61564916529.jpg",
      "strTags": "Soup",
      "youtubeVideo": "https://www.youtube.com/watch?v=VVnZd8A84z4",
      "ingredient1": "Lentils",
      "ingredient2": "Onion",
      "ingredient3": "Carrots",
      "ingredient4": "Tomato Puree",
      "ingredient5": "Cumin",
      "ingredient6": "Paprika",
      "ingredient7": "Mint",
      "ingredient8": "Thyme",
      "ingredient9": "Black Pepper",
      "ingredient10": "Red Pepper Flakes",
      "ingredient11": "Vegetable Stock",
      "ingredient12": "Water",
      "ingredient13": "Sea Salt",
      "source": "https://findingtimeforcooking.com/main-dishes/red-lentil-soup-corba/",
      "price": 11.48
    },
    {
      "mealId": "49",
      "mealName": "Fennel Dauphinoise",
      "category": "Side",
      "area": "French",
      "instructions": "Heat oven to 180C/160C fan/gas 4. Put potatoes, fennel, and garlic in a medium non-stick pan. Pour in milk and double cream, season well and simmer gently, covered, for 10 mins, stirring halfway through, until potatoes are just tender.\r\nDivide the mixture between 2 small (about 150ml) buttered ramekins and scatter with Parmesan. Bake for 40 mins until the potatoes are golden and tender when pierced with a knife. Snip the reserved fennel fronds over before serving.",
      "mealImage": "https://www.themealdb.com/images/media/meals/ytttsv1511798734.jpg",
      "strTags": "Pie,SideDish",
      "youtubeVideo": "https://www.youtube.com/watch?v=tXBzZm2kkh8",
      "ingredient1": "Potatoes",
      "ingredient2": "Fennel",
      "ingredient3": "Garlic",
      "ingredient4": "Milk",
      "ingredient5": "Double Cream",
      "ingredient6": "Butter",
      "ingredient7": "Parmesan Cheese",
      "source": "https://www.bbcgoodfood.com/recipes/fennel-dauphinoise",
      "price": 11.31
    },
    {
      "mealId": "50",
      "mealName": "Fresh sardines",
      "category": "Side",
      "area": "Croatian",
      "instructions": "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen towel to get rid of the excess oil and serve hot or cold with a slice of lemon.",
      "mealImage": "https://www.themealdb.com/images/media/meals/nv5lf31628771380.jpg",
      "strTags": "Fresh",
      "youtubeVideo": "https://www.youtube.com/watch?v=DDaZoXP1Mdc",
      "ingredient1": "Sardines",
      "ingredient2": "Vegetable Oil",
      "ingredient3": "Flour",
      "ingredient4": "Salt",
      "source": "https://www.visit-croatia.co.uk/croatian-cuisine/croatian-recipes/",
      "price": 22.21
    },
    {
      "mealId": "51",
      "mealName": "Broccoli & Stilton soup",
      "category": "Starter",
      "area": "British",
      "instructions": "Heat the rapeseed oil in a large saucepan and then add the onions. Cook on a medium heat until soft. Add a splash of water if the onions start to catch.\r\n\r\nAdd the celery, leek, potato and a knob of butter. Stir until melted, then cover with a lid. Allow to sweat for 5 minutes. Remove the lid.\r\n\r\nPour in the stock and add any chunky bits of broccoli stalk. Cook for 10 – 15 minutes until all the vegetables are soft.\r\n\r\nAdd the rest of the broccoli and cook for a further 5 minutes. Carefully transfer to a blender and blitz until smooth. Stir in the stilton, allowing a few lumps to remain. Season with black pepper and serve.",
      "mealImage": "https://www.themealdb.com/images/media/meals/tvvxpv1511191952.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=_HgVLpmNxTY",
      "ingredient1": "Rapeseed Oil",
      "ingredient2": "Onion",
      "ingredient3": "Celery",
      "ingredient4": "Leek",
      "ingredient5": "Potatoes",
      "ingredient6": "Butter",
      "ingredient7": "Vegetable Stock",
      "ingredient8": "Broccoli",
      "ingredient9": "Stilton Cheese",
      "source": "https://www.bbcgoodfood.com/recipes/1940679/broccoli-and-stilton-soup",
      "price": 24.97
    },
    {
      "mealId": "52",
      "mealName": "Clam chowder",
      "category": "Starter",
      "area": "American",
      "instructions": "Rinse the clams in several changes of cold water and drain well. Tip the clams into a large pan with 500ml of water. Cover, bring to the boil and simmer for 2 mins until the clams have just opened. Tip the contents of the pan into a colander over a bowl to catch the clam stock. When cool enough to handle, remove the clams from their shells – reserving a handful of empty shells for presentation if you want. Strain the clam stock into a jug, leaving any grit in the bottom of the bowl. You should have around 800ml stock.\r\nHeat the butter in the same pan and sizzle the bacon for 3-4 mins until it starts to brown. Stir in the onion, thyme and bay and cook everything gently for 10 mins until the onion is soft and golden. Scatter over the flour and stir in to make a sandy paste, cook for 2 mins more, then gradually stir in the clam stock then the milk and the cream.\r\nThrow in the potatoes, bring everything to a simmer and leave to bubble away gently for 10 mins or until the potatoes are cooked. Use a fork to crush a few of the potato chunks against the side of the pan to help thicken – you still want lots of defined chunks though. Stir through the clam meat and the few clam shells, if you've gone down that route, and simmer for a minute to reheat. Season with plenty of black pepper and a little salt, if needed, then stir through the parsley just before ladling into bowls or hollowed-out crusty rolls.",
      "mealImage": "https://www.themealdb.com/images/media/meals/rvtvuw1511190488.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=fEN_fm6kX6k",
      "ingredient1": "Clams",
      "ingredient2": "Butter",
      "ingredient3": "Bacon",
      "ingredient4": "Onion",
      "ingredient5": "Thyme",
      "ingredient6": "Bay Leaf",
      "ingredient7": "Plain Flour",
      "ingredient8": "Milk",
      "ingredient9": "Double Cream",
      "ingredient10": "Potatoes",
      "ingredient11": "Parsley",
      "source": "https://www.bbcgoodfood.com/recipes/clam-chowder",
      "price": 24.74
    },
    {
      "mealId": "53",
      "mealName": "Cream Cheese Tart",
      "category": "Starter",
      "area": "Unknown",
      "instructions": "Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy",
      "mealImage": "https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg",
      "strTags": "Tart,Savory",
      "youtubeVideo": "https://www.youtube.com/watch?v=UhQPwO4uymo",
      "ingredient1": "Flour",
      "ingredient2": "Butter",
      "ingredient3": "Egg",
      "ingredient4": "Salt",
      "ingredient5": "Cheese",
      "ingredient6": "Milk",
      "ingredient7": "Eggs",
      "ingredient8": "Parmesan Cheese",
      "ingredient9": "Plum tomatoes",
      "ingredient10": "White Vinegar",
      "ingredient11": "Honey",
      "ingredient12": "Basil",
      "source": "https://www.instagram.com/p/BHyuMZ1hZX0",
      "price": 23.66
    },
    {
      "mealId": "54",
      "mealName": "Creamy Tomato Soup",
      "category": "Starter",
      "area": "British",
      "instructions": "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls.",
      "mealImage": "https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg",
      "strTags": "Baking",
      "youtubeVideo": "https://www.youtube.com/watch?v=lBhwjjUiFk4",
      "ingredient1": "Olive Oil",
      "ingredient2": "Onions",
      "ingredient3": "Celery",
      "ingredient4": "Carrots",
      "ingredient5": "Potatoes",
      "ingredient6": "Bay Leaf",
      "ingredient7": "Tomato Puree",
      "ingredient8": "Sugar",
      "ingredient9": "White Vinegar",
      "ingredient10": "Chopped Tomatoes",
      "ingredient11": "Passata",
      "ingredient12": "Vegetable Stock Cube",
      "ingredient13": "Whole Milk",
      "source": "https://www.bbcgoodfood.com/recipes/2604646/creamy-tomato-soup",
      "price": 15.55
    },
    {
      "mealId": "55",
      "mealName": "Roast fennel and aubergine paella",
      "category": "Vegan",
      "area": "Spanish",
      "instructions": "1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.\r\n\r\n2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.\r\n\r\n3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.\r\n\r\n4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving.",
      "mealImage": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
      "strTags": "Vegan,Paella",
      "youtubeVideo": "https://www.youtube.com/watch?v=H5SmjR-fxUs",
      "ingredient1": "Baby Aubergine",
      "ingredient2": "Fennel",
      "ingredient3": "Red Pepper",
      "ingredient4": "Courgettes",
      "ingredient5": "Onion",
      "ingredient6": "Paella Rice",
      "ingredient7": "Paprika",
      "ingredient8": "Saffron",
      "ingredient9": "White Wine",
      "ingredient10": "Vegetable Stock",
      "ingredient11": "Frozen Peas",
      "ingredient12": "Lemon",
      "ingredient13": "Parsley",
      "ingredient14": "Salt",
      "ingredient15": "Black Pepper",
      "source": "https://www.homestylemag.co.uk/recipe/517/main-courses/roast-fennel-and-aubergine-paella",
      "price": 6.48
    },
    {
      "mealId": "56",
      "mealName": "Vegan Chocolate Cake",
      "category": "Vegan",
      "area": "American",
      "instructions": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
      "mealImage": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
      "strTags": "Vegan,Chocolate,Cake",
      "youtubeVideo": "https://www.youtube.com/watch?v=C3pAgB7pync",
      "ingredient1": "self raising flour",
      "ingredient2": "coco sugar",
      "ingredient3": "cacao",
      "ingredient4": "baking powder",
      "ingredient5": "flax eggs",
      "ingredient6": "almond milk",
      "ingredient7": "vanilla",
      "ingredient8": "water",
      "price": 19.24
    },
    {
      "mealId": "57",
      "mealName": "Vegan Lasagna",
      "category": "Vegan",
      "area": "Italian",
      "instructions": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
      "mealImage": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
      "strTags": "Vegan,Pasta",
      "youtubeVideo": "https://www.youtube.com/watch?v=VU8cXvlGbvc",
      "ingredient1": "green red lentils",
      "ingredient2": "carrot",
      "ingredient3": "onion",
      "ingredient4": "zucchini",
      "ingredient5": "coriander",
      "ingredient6": "spinach",
      "ingredient7": "lasagne sheets",
      "ingredient8": "vegan butter",
      "ingredient9": "flour",
      "ingredient10": "soya milk",
      "ingredient11": "mustard",
      "ingredient12": "vinegar",
      "price": 12.96
    },
    {
      "mealId": "58",
      "mealName": "Baingan Bharta",
      "category": "Vegetarian",
      "area": "Indian",
      "instructions": "Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r\nkeep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r\nthe smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r\ncooked. You could also embed some garlic cloves in the baingan and then roast it.\r\n2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r\neasily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r\ndown.\r\n3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r\nUse natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r\n4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r\naubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.\r\n5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the\r\ncharcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will\r\nbecome. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is\r\ncooked, just like the way we do for Dal Tadka.\r\n6. Peel the skin from the roasted and smoked eggplant.\r\n7. Chop the cooked eggplant finely or you can even mash it.\r\n8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.\r\n9. Saute the onions till translucent. Don't brown them.\r\n10. Add chopped green chilies and saute for a minute.\r\n11. Add the chopped tomatoes and mix it well.\r\n12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.\r\n13. Now add the red chili powder. Stir and mix well.\r\n14. Add the chopped cooked baingan.\r\n15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.\r\n16. Season with salt. Stir and saute for some more 4 to 5 minutes more.\r\n17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with\r\nphulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice.",
      "mealImage": "https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg",
      "strTags": "Spicy,Bun,Calorific",
      "youtubeVideo": "https://www.youtube.com/watch?v=-84Zz2EP4h4",
      "ingredient1": "Aubergine",
      "ingredient2": "Onion",
      "ingredient3": "Tomatoes",
      "ingredient4": "Garlic",
      "ingredient5": "Green Chilli",
      "ingredient6": "Red Chilli Powder",
      "ingredient7": "Oil",
      "ingredient8": "Coriander Leaves",
      "ingredient9": "salt",
      "source": "http://www.vegrecipesofindia.com/baingan-bharta-recipe-punjabi-baingan-bharta-recipe/",
      "price": 12.64
    },
    {
      "mealId": "59",
      "mealName": "Chickpea Fajitas",
      "category": "Vegetarian",
      "area": "Mexican",
      "instructions": "Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Drain the chickpeas, pat dry and tip onto the prepared baking tray. Add the oil and paprika, toss to coat, then roast for 20-25 mins until browned and crisp, shaking halfway through cooking.\r\n\r\nMeanwhile, put the tomatoes and onion in a small bowl with the vinegar and set aside to pickle. Put the avocado in another bowl and mash with a fork, leaving some larger chunks. Stir in the lime juice and season well. Mix the soured cream with the harissa and set aside until ready to serve.\r\n\r\nHeat a griddle pan until nearly smoking. Add the tortillas , one at a time, charring each side until hot with griddle lines. \r\n\r\nPut everything on the table and build the fajitas : spread a little of the harissa cream over the tortilla, top with roasted chickpeas, guacamole, pickled salsa and coriander, if you like. Serve with the lime wedges for squeezing over.",
      "mealImage": "https://www.themealdb.com/images/media/meals/tvtxpq1511464705.jpg",
      "strTags": "Vegetarian",
      "youtubeVideo": "https://www.youtube.com/watch?v=LGY3V7EGpT0",
      "ingredient1": "Chickpeas",
      "ingredient2": "Olive Oil",
      "ingredient3": "Paprika",
      "ingredient4": "Tomatoes",
      "ingredient5": "Red Onions",
      "ingredient6": "Red Wine Vinegar",
      "ingredient7": "Avocado",
      "ingredient8": "Lime",
      "ingredient9": "Lime",
      "ingredient10": "Sour Cream",
      "ingredient11": "Harissa Spice",
      "ingredient12": "Corn Tortillas",
      "ingredient13": "Coriander",
      "source": "https://www.bbcgoodfood.com/recipes/chickpea-fajitas",
      "price": 16.86
    },
    {
      "mealId": "60",
      "mealName": "Crispy Eggplant",
      "category": "Vegetarian",
      "area": "Filipino",
      "instructions": "Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.\r\n2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.\r\n3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.\r\n4. Heal oil in a large skillet over high heat.\r\n5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. \r\n",
      "mealImage": "https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg",
      "youtubeVideo": "https://www.youtube.com/watch?v=4mINk5d2hto",
      "ingredient1": "Egg Plants",
      "ingredient2": "Breadcrumbs",
      "ingredient3": "Sesame Seed",
      "ingredient4": "Eggs",
      "ingredient5": "Salt",
      "ingredient6": "Pepper",
      "ingredient7": "Vegetable Oil",
      "source": "https://yummyfood.ph/recipe/crispiest-fried-eggplant/",
      "price": 17.97
    },
    {
      "mealId": "61",
      "mealName": "Breakfast Potatoes",
      "category": "Breakfast",
      "area": "Canadian",
      "instructions": "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r\nWash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r\nIn the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r\nOnce the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r\nCook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r\nChop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r\nOnce the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r\nLet the garlic cook until fragrant, about one minute.\r\nJust before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r\nServe in a warm bowl with a sunny side up egg!",
      "mealImage": "https://www.themealdb.com/images/media/meals/1550441882.jpg",
      "strTags": "Breakfast,Brunch,",
      "youtubeVideo": "https://www.youtube.com/watch?v=BoD0TIO9nE4",
      "ingredient1": "Potatoes",
      "ingredient2": "Olive Oil",
      "ingredient3": "Bacon",
      "ingredient4": "Garlic Clove",
      "ingredient5": "Maple Syrup",
      "ingredient6": "Parsley",
      "ingredient7": "Salt",
      "ingredient8": "Pepper",
      "ingredient9": "Allspice",
      "source": "http://www.vodkaandbiscuits.com/2014/03/06/bangin-breakfast-potatoes/",
      "price": 22.24
    },
    {
      "mealId": "62",
      "mealName": "English Breakfast",
      "category": "Breakfast",
      "area": "British",
      "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
      "mealImage": "https://www.themealdb.com/images/media/meals/utxryw1511721587.jpg",
      "strTags": "Breakfast",
      "youtubeVideo": "https://www.youtube.com/watch?v=FXjYU2Ensck",
      "ingredient1": "Sausages",
      "ingredient2": "Bacon",
      "ingredient3": "Mushrooms",
      "ingredient4": "Tomatoes",
      "ingredient5": "Black Pudding",
      "ingredient6": "Eggs",
      "ingredient7": "Bread",
      "source": "https://www.bbc.co.uk/food/recipes/stressfreefullenglis_67721",
      "price": 16.55
    },
    {
      "mealId": "63",
      "mealName": "Full English Breakfast",
      "category": "Breakfast",
      "area": "British",
      "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
      "mealImage": "https://www.themealdb.com/images/media/meals/sqrtwu1511721265.jpg",
      "strTags": "Greasy,UnHealthy,HangoverFood,Calorific,Breakfast,BBQ",
      "youtubeVideo": "https://www.youtube.com/watch?v=FXjYU2Ensck",
      "ingredient1": "Sausages",
      "ingredient2": "Bacon",
      "ingredient3": "Mushrooms",
      "ingredient4": "Tomatoes",
      "ingredient5": "Black Pudding",
      "ingredient6": "Eggs",
      "ingredient7": "Bread",
      "ingredient8": "Baked Beans",
      "source": "https://www.bbc.co.uk/food/recipes/stressfreefullenglis_67721",
      "price": 18.32
    },
    {
      "mealId": "64",
      "mealName": "Home-made Mandazi",
      "category": "Breakfast",
      "area": "Kenyan",
      "instructions": "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.\r\nYou can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.\r\nFor “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.\r\n\r\n1. Mix the flour,cinnamon and sugar in a suitable bowl.\r\n2. In a separate bowl whisk the egg into the milk\r\n3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.\r\n4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.\r\n5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.\r\n6. Roll the dough on a lightly floured surface into a 1cm thick piece.\r\n7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.\r\n8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.\r\n9. Serve them warm or cold",
      "mealImage": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg",
      "strTags": "Baking,Breakfast,Egg,Warm,Snack",
      "ingredient1": "Self-raising Flour",
      "ingredient2": "Sugar",
      "ingredient3": "Eggs",
      "ingredient4": "Milk",
      "source": "http://chef-raphael.com/home-made-mandazi-recipe/#more-106",
      "price": 19.1
    }
  ],

  "categories": [
    {
      "categoryId": "1",
      "categoryName": "Beef",
      "CategoryImage": "https://www.themealdb.com/images/category/beef.png",
      "CategoryDescription": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times.[1] Beef is a source of high-quality protein and essential nutrients.[2]"
    },
    {
      "categoryId": "2",
      "categoryName": "Chicken",
      "CategoryImage": "https://www.themealdb.com/images/category/chicken.png",
      "CategoryDescription": "Chicken is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.[1] Humans commonly keep chickens as a source of food (consuming both their meat and eggs) and, more rarely, as pets."
    },
    {
      "categoryId": "3",
      "categoryName": "Dessert",
      "CategoryImage": "https://www.themealdb.com/images/category/dessert.png",
      "CategoryDescription": "Dessert is a course that concludes a meal. The course usually consists of sweet foods, such as confections dishes or fruit, and possibly a beverage such as dessert wine or liqueur, however in the United States it may include coffee, cheeses, nuts, or other savory items regarded as a separate course elsewhere. In some parts of the world, such as much of central and western Africa, and most parts of China, there is no tradition of a dessert course to conclude a meal.\r\n\r\nThe term dessert can apply to many confections, such as biscuits, cakes, cookies, custards, gelatins, ice creams, pastries, pies, puddings, and sweet soups, and tarts. Fruit is also commonly found in dessert courses because of its naturally occurring sweetness. Some cultures sweeten foods that are more commonly savory to create desserts."
    },
    {
      "categoryId": "4",
      "categoryName": "Lamb",
      "CategoryImage": "https://www.themealdb.com/images/category/lamb.png",
      "CategoryDescription": "Lamb, hogget, and mutton are the meat of domestic sheep (species Ovis aries) at different ages.\r\n\r\nA sheep in its first year is called a lamb, and its meat is also called lamb. The meat of a juvenile sheep older than one year is hogget; outside the USA this is also a term for the living animal. The meat of an adult sheep is mutton, a term only used for the meat, not the living animals. The term mutton is almost always used to refer to goat meat in the Indian subcontinent.\r\n\r\n"
    },
    {
      "categoryId": "5",
      "categoryName": "Miscellaneous",
      "CategoryImage": "https://www.themealdb.com/images/category/miscellaneous.png",
      "CategoryDescription": "General foods that don't fit into another category"
    },
    {
      "categoryId": "6",
      "categoryName": "Pasta",
      "CategoryImage": "https://www.themealdb.com/images/category/pasta.png",
      "CategoryDescription": "Pasta is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.\r\n\r\nAlso commonly used to refer to the variety of pasta dishes, pasta is typically a noodle made from an unleavened dough of a durum wheat flour mixed with water or eggs and formed into sheets or various shapes, then cooked by boiling or baking. As an alternative for those wanting a different taste, or who need to avoid products containing gluten, some pastas can be made using rice flour in place of wheat.[3][4] Pastas may be divided into two broad categories, dried (pasta secca) and fresh (pasta fresca)."
    },
    {
      "categoryId": "7",
      "categoryName": "Pork",
      "CategoryImage": "https://www.themealdb.com/images/category/pork.png",
      "CategoryDescription": "Pork is the culinary name for meat from a domestic pig (Sus scrofa domesticus). It is the most commonly consumed meat worldwide,[1] with evidence of pig husbandry dating back to 5000 BC. Pork is eaten both freshly cooked and preserved. Curing extends the shelf life of the pork products. Ham, smoked pork, gammon, bacon and sausage are examples of preserved pork. Charcuterie is the branch of cooking devoted to prepared meat products, many from pork.\r\n\r\nPork is the most popular meat in Eastern and Southeastern Asia, and is also very common in the Western world, especially in Central Europe. It is highly prized in Asian cuisines for its fat content and pleasant texture. Consumption of pork is forbidden by Jewish and Muslim dietary law, a taboo that is deeply rooted in tradition, with several suggested possible causes. The sale of pork is limited in Israel and illegal in certain Muslim countries."
    },
    {
      "categoryId": "8",
      "categoryName": "Seafood",
      "CategoryImage": "https://www.themealdb.com/images/category/seafood.png",
      "CategoryDescription": "Seafood is any form of sea life regarded as food by humans. Seafood prominently includes fish and shellfish. Shellfish include various species of molluscs, crustaceans, and echinoderms. Historically, sea mammals such as whales and dolphins have been consumed as food, though that happens to a lesser extent in modern times. Edible sea plants, such as some seaweeds and microalgae, are widely eaten as seafood around the world, especially in Asia (see the category of sea vegetables). In North America, although not generally in the United Kingdom, the term \"seafood\" is extended to fresh water organisms eaten by humans, so all edible aquatic life may be referred to as seafood. For the sake of completeness, this article includes all edible aquatic life."
    },
    {
      "categoryId": "9",
      "categoryName": "Side",
      "CategoryImage": "https://www.themealdb.com/images/category/side.png",
      "CategoryDescription": "A side dish, sometimes referred to as a side order, side item, or simply a side, is a food item that accompanies the entre or main course at a meal. Side dishes such as salad, potatoes and bread are commonly used with main courses throughout many countries of the western world. New side orders introduced within the past decade[citation needed], such as rice and couscous, have grown to be quite popular throughout Europe, especially at formal occasions (with couscous appearing more commonly at dinner parties with Middle Eastern dishes)."
    },
    {
      "categoryId": "10",
      "categoryName": "Starter",
      "CategoryImage": "https://www.themealdb.com/images/category/starter.png",
      "CategoryDescription": "An entre in modern French table service and that of much of the English-speaking world (apart from the United States and parts of Canada) is a dish served before the main course of a meal; it may be the first dish served, or it may follow a soup or other small dish or dishes. In the United States and parts of Canada, an entre is the main dish or the only dish of a meal.\r\n\r\nHistorically, the entre was one of the stages of the Classical Order of formal French table service of the 18th and 19th centuries. It formed a part of the first service of the meal, which consisted of potage, hors duvre, and entre (including the bouilli and relev). The second service consisted of roast (rti), salad, and entremets (the entremets sometimes being separated into a third service of their own). The final service consisted only of dessert.[3]:311 :1325"
    },
    {
      "categoryId": "11",
      "categoryName": "Vegan",
      "CategoryImage": "https://www.themealdb.com/images/category/vegan.png",
      "CategoryDescription": "Veganism is both the practice of abstaining from the use of animal products, particularly in diet, and an associated philosophy that rejects the commodity status of animals.[b] A follower of either the diet or the philosophy is known as a vegan (pronounced /vin/ VEE-gn). Distinctions are sometimes made between several categories of veganism. Dietary vegans (or strict vegetarians) refrain from consuming animal products, not only meat but also eggs, dairy products and other animal-derived substances.[c] The term ethical vegan is often applied to those who not only follow a vegan diet but extend the philosophy into other areas of their lives, and oppose the use of animals for any purpose.[d] Another term is environmental veganism, which refers to the avoidance of animal products on the premise that the harvesting or industrial farming of animals is environmentally damaging and unsustainable."
    },
    {
      "categoryId": "12",
      "categoryName": "Vegetarian",
      "CategoryImage": "https://www.themealdb.com/images/category/vegetarian.png",
      "CategoryDescription": "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.\r\n\r\nVegetarianism may be adopted for various reasons. Many people object to eating meat out of respect for sentient life. Such ethical motivations have been codified under various religious beliefs, as well as animal rights advocacy. Other motivations for vegetarianism are health-related, political, environmental, cultural, aesthetic, economic, or personal preference. There are variations of the diet as well: an ovo-lacto vegetarian diet includes both eggs and dairy products, an ovo-vegetarian diet includes eggs but not dairy products, and a lacto-vegetarian diet includes dairy products but not eggs. A vegan diet excludes all animal products, including eggs and dairy. Some vegans also avoid other animal products such as beeswax, leather or silk clothing, and goose-fat shoe polish."
    },
    {
      "categoryId": "13",
      "categoryName": "Breakfast",
      "CategoryImage": "https://www.themealdb.com/images/category/breakfast.png",
      "CategoryDescription": "Breakfast is the first meal of a day. The word in English refers to breaking the fasting period of the previous night. There is a strong likelihood for one or more \"typical\", or \"traditional\", breakfast menus to exist in most places, but their composition varies widely from place to place, and has varied over time, so that globally a very wide range of preparations and ingredients are now associated with breakfast."
    }
  ]
}
